/*
 * PosAPI 3.0 системийн API холболт зааврууд
 * ---  stoplight-id: 8mw1byololjkv   ---    ## ЦАХИМ ТӨЛБӨРИЙН БАРИМТЫН СИСТЕМ POS API 3.0    ### Холбоо барих мэдээлэл    | № | Төрөл | Холбоо барих | Хариуцагч |  | -------- | ------- | ------- | ------- |  | 1  | Цахим шуудан хаяг | posapi@itc.gov.mn | Б.Булганжаргал   |  | 1  | Утас | 99974468 | Б.Булганжаргал   |    ### Танилцуулга     <!-- theme: none -->    > **1.1. Хэрэглэгчийн систем болон PosAPI нь REST service ашиглан мэдээлэл солилцдог болсон нь өмнөх хувилбараас давуу талтай.**  > PosAPI 2.0 хувилбар нь програмын сан байдлаар хөгжүүлэгдсэн бөгөөд хэрэглэгчийн системд суурилж ажилладаг. Иймд тухайн хэрэглэгчийн системээс хэт хамааралтай, өөрчлөлт шинэчлэлтийг хийх боломжгүй байдаг. PosAPI 3.0-н хувьд бие даасан тусдаа service application тул хэрэглэгчийн системээс үл хамааран ажилладаг. Энэ нь дээрх 2.0 хувилбар дээр гарч байсан алдаа дутагдлыг арилгаж өгч байна.PosAPI 2.0 нь хэрэглэгчийн системийн нэг хэсэг болж ажиллахын тулд мэдээллийг function ашиглан солилцдог байсныг 3.0 хувилбар дээр өөрчлөн REST WebService ашиглан солилцдог болсон. Мөн хэрэглэгчийн систем болон PosAPI-н хоорондоо Server-Client хэлбэрээр ажиллах бүрэн боломжийг нээж өгсөн.    - [POS API 3.0 татах (Бодит орчин)](https://share.itc.gov.mn/share/developer/PosService_3.0.12-Prod.zip)  - [POS API 3.0 татах (Хөгжүүлэлтийн орчин)](https://share.itc.gov.mn/share/developer/ST_PosService_3.0.12-Staging.zip)    <!-- theme: none -->    > **1.2. Нэг PosAPI-г хэд хэдэн этгээд ашиглан,баримтын мэдээлэл солилцох боломжийг бүрдүүлсэн.**  > PosAPI 2.0 хувилбар нь зөвхөн нэг иргэн, ААН-ийн баримтыг хүлээн авах боломжтой байсан. Энэ нь > > сервер шийдэл бүхий хэрэглэгчийн системийн хувьд төвөгтэй шийдэл юм. Харин PosAPI 3.0 хувилбарын > хувьд энэхүү асуудлыг бүрэн шийдвэрлэсэн.  > PosAPI 3.0 хувилбар нь өөр дээрээ нэг болон түүнээс дээш тооны ААН, иргэнийг бүртгэн,тэдгээрийн > баримтыг бүртгэх боломжтой болсон.    ### PosAPI тохируулах:     > PosAPI нь суусны дараа анхны байдлаар тохируулах шаардлагатай. “posapi.ini” файлд тухайн PosAPI-н үндсэн тохиргоо байрлах ба “P101.poi, P102.poi” файлуудад ажиллагааны тохиргоо байрлах ба нууцлагдсан байна.    Үндсэн тохиргооны тайлбар /posapi.ini файл/    | Нэр              | Талбар                                                                        |  | ---------------- | ----------------------------------------------------------------------------- |  | authUrl          | Тухайн PosAPI-н нэгдсэн нэвтрэлттэй холбогдох тохиргоо./Өөрчлөх шаардлагагүй/ |  | authRealm        | Тухайн PosAPI-н нэгдсэн нэвтрэлттэй холбогдох тохиргоо./Өөрчлөх шаардлагагүй/ |  | authClientId     | Тухайн PosAPI-н нэгдсэн нэвтрэлттэй холбогдох тохиргоо./Өөрчлөх шаардлагагүй/ |  | authClientSecret | Тухайн PosAPI-н нэгдсэн нэвтрэлттэй холбогдох тохиргоо./Өөрчлөх шаардлагагүй/ |  | ebarimtUrl       | Ebarimt системтэй холбогдох хаяг. /Өөрчлөх шаардлагагүй/                      |  | db               | Өгөгдлийн сангийн driver.                                                     |  | dbHost           | Өгөгдлийн сангийн хаяг. /Хэрэв QSQLITE бол файлын зам байна/                  |  | dbPort           | Өгөгдлийн сангийн port. /Хэрэв QSQLITE бол бөглөхгүй/                         |  | dbUser           | Өгөгдлийн сангийн хэрэглэгчийн нэр. /Хэрэв QSQLITE бол бөглөхгүй/             |  | dbPass           | Өгөгдлийн сангийн нууц үг. /Хэрэв QSQLITE бол бөглөхгүй/                      |  | dbName           | Өгөгдлийн сангийн баазын нэр. /Хэрэв QSQLITE бол бөглөхгүй/                   |  | dbOptions        | Өгөгдлийн сангийн нэмэлт тохиргоо. /Хэрэв QSQLITE бол бөглөхгүй/              |  | workDir          | PosAPI-н ажиллагааны хавтас                                                   |  | webServiceHost   | PosAPI-н ажиллах сүлжээний IP address                                         |  | webServicePort   | PosAPI-н ажиллах сүлжээний port                                               |    <!-- theme: none -->  ⚠ Анхаарах зүйлс:  \"workDir\" хавтсанд байрлах тохиргооны файлууд тогтмол өөрчлөгдөж байдаг тул PosAPI-г ажиллуулж буй хэрэглэгч нь унших, бичих эрхтэй байх шаардлагатай. Уг хавтсыг \"FREEZE\" хийж болохгүй    PosAPI-н дэмжиж ажиллах өгөгдлийн сангууд ба driver-ууд    | Нэр     | Талбар                        |  | ------- | ----------------------------- |  | QMYSQL  | MySQL эсвэл MariaDB           |  | QPSQL   | PostgreSQL                    |  | QODBC   | ODBC for Microsoft SQL Server |  | QSQLITE | SQLite version 3              |    ⚠ Анхаарах зүйл:  PosAPI нь ачаалагдах үедээ өгөгдлийн сангийн хүснэгтүүдийг автоматаар үүсгэдэг. Тиймээс уг тохиргоог хийх хэрэглэгч нь хүснэгт үүсгэх эрхтэй байх шаардлагатай.  Сүлжээний тохиргоо:    Тохиргоо | Шаардлага  ---------|----------   Хадгалах сан (Storage) | Хамгийн багадаа 1GB сул зайтай байх    Сүлжээний хурд | Хамгийн багадаа 80 Mbps    Хандах эрхийн нөхцөл | Зөвхөн Монгол Улсын сүлжээнээс хандах боломжтой /Гадаадаас холбогдох бол Монгол IP-тэй VPN ашиглана./    >Зөвшөөрөгдсөн IP хаягууд /Network/:   Домэйн | Серверийн IP   ---------|----------   api.ebarimt.mn  | 103.17.108.216, 103.17.108.217   auth.itc.gov.mn | 103.87.69.75, 103.87.69.76  > PosAPI нь үндсэн тохиргоогоор SQLITE баазыг сонгосон байдаг бөгөөд уг тохиргоо нь цөөн тооны баримт үйлддэг хэрэглэгчийн системд илүү тохиромжтой байдаг. Харин олон тооны баримт үйлддэг хэрэглэгчийн системд SQLITE бааз нь зохимжгүй бөгөөд бусад төрлийн баазыг ашиглах нь илүү үр дүнтэй.    ### PosAPI идэвхжүүлэх:    > PosAPI суулгасны дараа идэвхгүй төлөвт байдаг ба уг төлөвт аль ч сервисийг дуудсан ажиллахгүй. Идэвхжүүлэхийн тулд PosAPI систем рүү оператор эрх бүхий иргэн нэвтэрч орох шаардлагатай. Хэрэв нэвтрэх үйлдэл хийгдсэн бол PosAPI ийг идэвхжүүлэх процесс дуудагдаж, тухайн PosAPI-г нэвтэрсэн операторын бүртгэлд бүртгэж шинээр сугалааны дугаар авна.    ![image001.png](../assets/images/image001.png)    PosAPI-руу хандах port нь posapi.ini файлд тохируулсан port байна /default port: 7080/.  Мөн тухайн иргэн нь хэд хэдэн операторын эрхтэй байж болох бөгөөд PosAPI-г идэвхжүүлэхдээ зөвхөн нэг оператороо сонгон идэвхжүүлнэ    ![image002.png](../assets/images/image002.png)    PosAPI амжилттай идэвхэжсэн үед дараах байдлаар харагдана.    ![es.png](../assets/images/es.png)    > Эм, эмнэлгийн хэрэгслийн чанар, аюулгүй байдал, хангамж, хүртээмжийг нэгдсэн цахим тогтолцоогоор хянах, цахимжилтыг эрчимжүүлэх зорилгоор шинэчлэн батлагдсан Эм, эмнэлгийн хэрэгслийн тухай 11 дүгээр зүйлийн 11.1.7, 47 дугаар зүйлийн 47.11.1, 47.12 зүйлд тус тус заасны дагуу эм, эмнэлгийн хэрэгсэл борлуулагч этгээд нь эм, эмнэлгийн хэрэгслийн цувралын дугаар, стандарт код, тоо хэмжээг төлбөрийн баримтад тусган, цахим санд хадгалах боломжийг бүрдүүлсэн. Дээрх өөрчлөлтийн дагуу тухайн төрлийн бүтээгдэхүүн борлуулагч \"Эмийн сан\"-ийн PosAPI системд \"Посын нөхцөл\" хэсгийн \"Эмийн сан\" сонголтыг сонгон хадгална. Мөн төлбөрийн баримт үүсгэх JSON-д цувралын дугаарыг нэмэлтээр оруулна.    Анхаарах зүйлс :    1. Эмийн сангийн POSAPI 3.0 холболт бол заавал эмийн сан гэсэн checkbox сонголтыг идэвхжүүлж хадгалах.  2. Эмийн сан check хийсэн үед эмийн бүтээгдэхүүнүүдийн хамт нэг дэд баримтад илгээнэ  3. \"data\":{\"lotNo\":\"эмийн бүтээгдэхүүний цувралын дугаар\"} илгээхийг анхаарна уу.    <!-- theme: warning -->    ### Кодын жагсаалт:    - [Бүтээгдэхүүн үйлчилгээний нэгдсэн ангиллын код](https://share.itc.gov.mn/share/developer/gs1\\_gs1.xlsx)    ### Өөрчлөлтийн түүх    | № | Хувилбар | Огноо | Тайлбар | Хариуцагч |  | -------- | ------- | ------- | ------- | ------- |  | 1  | 1.0.0 | 03/31/2025 | Гарын авлага боловсруулав | Б.Мөнгөнчимэг   |
 *
 * The version of the OpenAPI document: 3.0
 *
 *
 * NOTE: This class is auto generated by OpenAPI Generator (https://openapi-generator.tech).
 * https://openapi-generator.tech
 * Do not edit the class manually.
 */


package com.github.uugan.posapi.api;

import com.github.uugan.posapi.Configuration;
import com.github.uugan.posapi.PosApiClient;
import com.github.uugan.posapi.PosApiException;
import com.github.uugan.posapi.model.*;
import com.github.uugan.posapi.model.PostRestReceiptResponse;
import org.junit.jupiter.api.BeforeAll;
import org.junit.jupiter.api.Disabled;
import org.junit.jupiter.api.Test;

import java.math.BigDecimal;
import java.util.List;

/**
 * API tests for PosApi
 */
@Disabled
public class PosApiTest {
    private static PosApiClient defaultClient;
    private static PosApi api;


    @BeforeAll
    public static void initDefaultClient() {
        defaultClient = Configuration.getDefaultApiClient();
        defaultClient.setBasePath("http://localhost:7080");

        api = new PosApi(defaultClient);
      //  api.setHostIndex(1);
    }
    /**
     * Төлбөрийн баримт буцаах
     * <p>
     * &gt;Энэхүү сервис нь барааны буцаалт хийгдсэн болон алдаатай үүссэн Хувь хүн (B2C_RECEIPT) руу шивсэн төлбөрийн баримтыг системд идэвхгүй болгох зориулалттай.      ⚠️ Анхаарах зүйлс:    &lt;!-- theme: warning --&gt;    * Зөвхөн иргэн баталгаажуулаагүй баримтыг идэвхгүй болгох боломжтой.  * Хэрэв баталгаажсан баримт буцаагдсан бол баримт \&quot;Баталгаажаагүй буцаалт\&quot; гэсэн төлөвтэй болж,  * Иргэн өөрийн ИБАРИМТ аппликейшнээс зөвшөөрсний дараа тухайн баримт идэвхгүй болно.
     *
     * @throws PosApiException if the Api call fails
     */
    @Test
    public void deleteRestReceiptTest() throws PosApiException {
        DeleteRestReceiptRequest deleteRestReceiptRequest = null;
        api.deleteRestReceipt(deleteRestReceiptRequest);
        // TODO: test validations
    }

    /**
     * Баркод жагсаалтаар лавлах
     * <p>
     * &gt;Энэхүү сервис нь Цахим төлбөрийн баримтын системийн PosAPI 3.0 хувилбарыг ашиглагч хэрэглэгчдэд зориулсан бөгөөд Бараа бүртгэлийн нэгдсэн систем (ББНС)-д бүртгэлтэй бараа, бүтээгдэхүүний баркодын мэдээллийг хуудаслалтайгаар лавлах боломжийг олгодог.    &lt;!-- theme: warning --&gt;  &gt;Энэхүү сервис нь БҮНА-ын ангиллын түвшингээр мэдээлэл авах боломжтой бөгөөд параметрүүдийг өөрчлөн дуудаж ашиглаж болно. 🔗 [Дэлгэрэнгүй мэдээлэлтэй танилцах  бол энд дарна уу](https://developer.itc.gov.mn/docs/ebarimt-api/said1mgfz0gb7-b-na-baraa-b-teegdeh-nij-angilal-barkod-lavlah)
     *
     * @throws PosApiException if the Api call fails
     */
    @Test
    public void getApiInfoCheckBarcodeAllTest() throws PosApiException {
        String page = null;
        String size = null;
        String date = null;
        GetApiInfoCheckBarcodeAllResponse response = api.getApiInfoCheckBarcodeAll(page, size, date);
        // TODO: test validations
    }

    /**
     * БҮНА, бараа бүтээгдэхүүний ангилал, баркод лавлах
     * <p>
     * &gt;Энэхүү сервис нь Цахим төлбөрийн баримтын системийн PosAPI 3.0 хувилбарыг ашиглагч хэрэглэгчдэд зориулан Бараа, Үйлчилгээний Нэгдсэн Ангилал (БҮНА)-ын түвшин тус бүр болон тухайн ангилалд хамаарах баркодын мэдээллийг лавлах, ашиглах зориулалттай болно.  🔍 Энэхүү сервис нь Бараа, Үйлчилгээний Нэгдсэн Ангилал (БҮНА)-ын шатлалтай бүтэцтэй ангиллын мэдээллийг үе шаттайгаар лавлах боломжийг хэрэглэгчдэд олгодог.    1️⃣Сервисийг ямар нэгэн параметргүйгээр дуудсан тохиолдолд хамгийн дээд түвшний ангилал болох \&quot;Салбар\&quot;-ын жагсаалтыг буцаана.    2️⃣Салбарын код-ыг параметрээр илгээх үед тухайн салбарт хамаарах \&quot;Дэд салбар\&quot;-уудын жагсаалт ирнэ.    3️⃣Дэд салбарын код-ыг параметрт оруулснаар уг дэд салбарт хамаарах \&quot;Бүлэг\&quot; ангиллын мэдээллийг буцаана.    4️⃣Бүлгийн код-ыг параметрт оруулахад холбогдох \&quot;Анги\&quot;,\&quot;Дэд анги\&quot; цаашлаад \&quot;БҮНА код\&quot;, эцэст нь тухайн БҮНА кодын ангилалд багтах барааны баркодын жагсаалтыг харуулна.    5️⃣Ийм байдлаар шат дараатайгаар ангиллын кодыг параметрт дамжуулан илгээснээр БҮНА-ийн бүтэцтэй уялдсан \&quot;Баркод\&quot;-ын мэдээллийг авах боломжтой.
     *
     * @throws PosApiException if the Api call fails
     */
    @Test
    public void getApiInfoCheckBarcodeV2Test() throws PosApiException {
        String p1 = null;
        String p2 = null;
        String p3 = null;
        String p4 = null;
        String p5 = null;
        String p6 = null;
        List<List<String>> response = api.getApiInfoCheckBarcodeV2(p1, p2, p3, p4, p5, p6);
        // TODO: test validations
    }

    /**
     * District_code лавлах
     * <p>
     * &gt;Цахим төлбөрийн баримтын систем (PosAPI)-ээс үүсгэж буй төлбөрийн баримтын үйл ажиллагаа явуулж буй байршлын мэдээллийг \&quot;districtCode\&quot; гэсэн баганад бөглөн илгээдэг. Энэ талбарт бөглөсөн байршлын татварын алба болон дэд албаны кодын жагсаалтын мэдээллийг энэхүү сервисээс авах боломжтой.    &gt;Жишээ: Номин холдинг ХХК-ийн Архангай аймгийн Чулуут сум дахь салбараас үүсгэсэн баримтын \&quot;districtCode\&quot;-г 0102 гэж бөглөн илгээнэ.
     *
     * @throws PosApiException if the Api call fails
     */
    @Test
    public void getApiInfoCheckGetBranchInfoTest() throws PosApiException {
        GetApiInfoCheckGetBranchInfoResponse response = api.getApiInfoCheckGetBranchInfo();
        // TODO: test validations
    }

    /**
     * Бүртгэлийн мэдээлэл лавлах
     * <p>
     * &gt;Энэхүү сервис нь “Татвар төлөгчийн дугаар”-аар тухайн этгээдийн татварын бүртгэл, мэдээллийн нэгдсэн санд байх бүртгэлийн мэдээллийг дамжуулах үүрэгтэй ба хэрэглэгчийн систем нийлүүлэгч нь өөрийн хөгжүүлж буй системд холбон ашиглах боломжтой.    [Регистрийн дугаар ашилан TIN дугаар авах бол дарна уу.](ebarimt.yaml/paths/~1api~1info~1check~1getTinInfo/get)
     *
     * @throws PosApiException if the Api call fails
     */
    @Test
    public void getApiInfoCheckGetInfoTest() throws PosApiException {
        String tin = null;
        GetApiInfoCheckGetInfoResponse response = api.getApiInfoCheckGetInfo(tin);
        // TODO: test validations
    }

    /**
     * Татвар төлөгчийн дугаар лавлах /ТIN, Civil_id/
     * <p>
     * &gt;Татвар төлөгчийн дугаар лавлах сервис /ТIN, Civil_id/: Шинэчлэн батлагдсан Хувь хүний мэдээлэл хамгаалах тухай хууль, Татварын ерөнхий хуульд заасны дагуу татвар төлөгчийг татварын системүүдэд бүртгэхдээ “Татвар төлөгчийн дугаар” ашиглахаар болсон. Дээрх хуулийн дагуу систем нийлүүлэгч нь PosApi 3.0 системд борлуулагчийг бүртгэхдээ “Хуулийн этгээд”-ийн хувьд ТИН дугаар, “Хувь хүн”-ий хувьд Civil_id-г ашиглах ба энэхүү сервис нь татвар төлөгчийн дугаарыг регистрийн дугаараар лавлах боломжийг бүрдүүлсэн.
     *
     * @throws PosApiException if the Api call fails
     */
    @Test
    public void getApiInfoCheckGetTinInfoTest() throws PosApiException {
        String regNo = null;
        GetApiInfoCheckGetTinInfoResponse response = api.getApiInfoCheckGetTinInfo(regNo);
        // TODO: test validations
    }

    /**
     * ОАТ барааны баркодын мэдээлэл лавлах /QR/
     * <p>
     * &gt;Онцгой албан татварын тэмдэг бүхий барааны баркод болон бусад дэлгэрэнгүй мэдээллийг \&quot;Тэмдгийн QR ID\&quot; ашиглан лавлах бол энэхүү сервисийг ашиглах ба PosAPI 3.0 системийн \&quot;PosAPI-руу төлбөрийн баримт хадгалах сервис\&quot; /post-rest-receipt/-ийн stockQR талбарт хадгалах өгөгдлийг лавлахад ашиглагдана. [Нэгдсэн нэвтрэлтийн token авах бол дарна уу.](reference/auth_copy.yaml/paths/~1protocol~1openid-connect~1token/post)
     *
     * @throws PosApiException if the Api call fails
     */
    @Test
    public void getApiInventoryStockGetStockQrTest() throws PosApiException {
        String stockQr = null;
        GetApiInventoryStockGetStockQrResponse response = api.getApiInventoryStockGetStockQr(stockQr);
        // TODO: test validations
    }

    /**
     * VAT_FREE, VAT_ZERO, NO_VAT бараа, үйлчилгээний код лавлах
     * <p>
     * &gt;Нэмэгдсэн өртгийн албан татвар /НӨАТ-аас чөлөөлөгдөх, НӨАТ-н 0 хувь хэрэглэх/, Аж ахуйн нэгжийн орлогын албан татвараас чөлөөлөгдөх хуулийн кодыг жагсаалтаар авах бол энэхүү сервисийг ашиглах ба PosAPI 3.0 системийн \&quot;PosAPI-руу төлбөрийн баримт хадгалах сервис\&quot; /post-rest-receipt/-ийн taxProductCode талбарт хадгалах өгөгдлийг лавлахад ашиглагдана.
     *
     * @throws PosApiException if the Api call fails
     */
    @Test
    public void getApiReceiptReceiptGetProductTaxCodeTest() throws PosApiException {
        GetApiReceiptReceiptGetProductTaxCodeResponse response = api.getApiReceiptReceiptGetProductTaxCode();
        // TODO: test validations
    }

    /**
     * Банкны дансны мэдээлэл лавлах
     * <p>
     * &gt;Банкны дансны мэдээлэл лавлах сервис нь Оператор компанид хэрэглэгчээр бүртгэгдсэн \&quot;Мерчант\&quot; болон түүний \&quot;Түрээслэгч\&quot;-ийн Local баазын \&quot;bankaccount\&quot; хүснэгт-д бүртгэгдсэн идэвхтэй дансны мэдээллийг лавлахад зориулагдсан.     &lt;!-- theme: warning --&gt;    &gt;PosAPI 3.0 систем дэх дансны мэдээлэл шинэчлэх тухай    ✅ PosAPI 3.0 систем нь local баазын \&quot;bankaccount\&quot; дээр дансны мэдээллийг хадгалж, уг өгөгдөлд үндэслэн баримтын дансыг үүсгэдэг.    🔄 Дансны мэдээлэл хэрхэн шинэчлэгддэг вэ?    ПосАПИ дахь дансны мэдээлэл өөрчлөгдвөл баримт илгээх (/senddata/) үйлдэл хийгдэх үед    1️⃣ Дансны дугааруудыг Оператор-Ибаримт систем дэх бүртгэлтэй тулган шалгана.    2️⃣ Хэрэв өөрчлөлт илэрвэл автоматаар шинэчлэнэ.    ⚠ Анхаарах зүйлс:    Нэг ПосАПИ баримт илгээх (/senddata/) үйлдэл хийснээр зөвхөн тухайн ПосАПИ-гийн дансны мэдээлэл шинэчлэгдэнэ.    Бусад ПосАПИ-д энэ өөрчлөлт нөлөөлөхгүй тул, хэрэв таны аль нэг бүртгэлтэй Мерчантын дансны мэдээлэл өөрчлөгдвөл тухайн өөрчлөгдсөн Мерчант бүртгэгдсэн ПосАПИ тус бүрт баримт илгээж, шинэчлэл хийх шаардлагатай.    Иймд дансны мэдээлэл өөрчлөгдсөн тохиолдолд бүх холбогдох ПосАПИ дээр шинэчлэл хийхээ    &gt; \&quot; \&quot;Баримт илгээх\&quot; үйлдэл хийсэн Local бааз дахь дансны мэдээлэл шинэчлэгдэхгүй бол Мерчант болон түүний түрээслэгч нь системд дансаа бүртгээгүй, эсвэл мэдээллээ шинэчлээгүй байх магадлалтай.    ✅ Шийдэл:    \&quot;Цахим татварын систем\&quot;-д нэвтэрч, дансаа бүртгэх эсвэл өөрчилнө.    E-invoice системийн \&quot;Баримт үүсгэх\&quot; цонхны \&quot;Банкны мэдээлэл\&quot; хэсгээс &lt;i class&#x3D;\&quot;fa-solid fa-download\&quot;&gt;&lt;/i&gt; товчийг дарж, мэдээллээ шинэчлэн татна.
     *
     * @throws PosApiException if the Api call fails
     */
    @Test
    public void getRestBankAccountstinTINTest() throws PosApiException {
        String tin = null;
        List<GetRestBankAccountsTinTINResponse> response = api.getRestBankAccountstinTIN(tin);
        // TODO: test validations
    }

    /**
     * Ажиллагааны мэдээлэл хүлээн авах
     * <p>
     * Энэхүү сервис нь \&quot;PosAPI 3.0\&quot; системийн тохиргоо болон ажиллагааны талаарх мэдээллийг лавлахад зориулагдсан.
     *
     * @throws PosApiException if the Api call fails
     */
    @Test
    public void getRestInfoTest() throws PosApiException {
        GetRestInfoResponse response = api.getRestInfo();
        // TODO: test validations
    }

    /**
     * Төлбөрийн баримтын нэгдсэн системд мэдээлэл илгээх
     * <p>
     * &gt;Сервисийг заавал дуудах шаардлагагүй бөгөөд PosAPI систем нь тодорхой хугацаанд автоматаар энэхүү үйлдлийг гүйцэтгэдэг. 🔄 Хэрэв PosAPI-д хамааралтай өөрчлөлт нэгдсэн систем талд гарсан бол энэ сервисийг дуудснаар тухайн өөрчлөлтийг local баазад хадгалах боломжтой.
     *
     * @throws PosApiException if the Api call fails
     */
    @Test
    public void getRestSendDataTest() throws PosApiException {
        Object response = api.getRestSendData();
        // TODO: test validations
    }

    /**
     * Оператороос мерчант бүртгэх хүсэлт илгээх
     * <p>
     * &gt;Энэхүү сервис нь \&quot;Хэрэглэгчийн систем нийлүүлэгч\&quot; (Оператор компани) өөрийн системээс \&quot;Мерчант\&quot; (Борлуулагч) бүртгэх хүсэлт үүсгэх боломжийг бүрдүүлнэ[Нэгдсэн нэвтрэлтийн token авах бол дарна уу.](reference/auth.yaml/paths/~1protocol~1openid-connect~1token/post)
     *
     * @throws PosApiException if the Api call fails
     */
    @Test
    public void postApiTpiReceiptSaveOprMerchantsTest() throws PosApiException {
        String X_API_KEY = null;
        PostApiTpiReceiptSaveOprMerchantsRequest postApiTpiReceiptSaveOprMerchantsRequest = null;
        PostApiTpiReceiptSaveOprMerchantsResponse response = api.postApiTpiReceiptSaveOprMerchants(X_API_KEY, postApiTpiReceiptSaveOprMerchantsRequest);
        // TODO: test validations
    }

    /**
     * Төлбөрийн баримт хадгалах
     * <p>
     * &gt;Энэхүү сервис нь хэрэглэгчийн системээс борлуулалтын мэдээллийг хүлээн авч, дараах мэдээллүүдийг нэмж боловсруулан буцаана:   *ДДТД  *Сугалааны дугаар  *Баримт хэвлэсэн огноо  *Баримтын код  *QrCode    ⚠️ **Анхаарах зүйлс:**  &lt;!-- theme: warning --&gt;  &gt;Эдгээр буцаасан мэдээллүүдээс lottery болон qrData талбаруудын мэдээллийг төлбөрийн баримтанд хэвлэхээс өөрөөр ямар ч хэлбэрээр хадгалахыг хориглоно.
     *
     * @throws PosApiException if the Api call fails
     */
    @Test
    public void postRestReceiptTest() throws PosApiException {
        PostRestReceiptRequest post = new PostRestReceiptRequest()
                .branchNo("001")
                .totalAmount(BigDecimal.valueOf(5600))
                .totalVAT(BigDecimal.valueOf(500))
                .totalCityTax(BigDecimal.valueOf(100))
                .districtCode("2501")
                .merchantTin("110718991986")
                .posNo("001")
                .customerTin(null)
                .consumerNo("10038071")
                .type("B2C_RECEIPT")
                .inactiveId(null)
                .reportMonth(null)
                .billIdSuffix("01");

// item
        PostRestReceiptRequestReceiptItem item = new PostRestReceiptRequestReceiptItem()
                .name("Талх")
                .barCode("19059010880001")
                .barCodeType("GS1")
                .classificationCode("2349010")
                .taxProductCode(null)
                .measureUnit("ш")
                .qty(BigDecimal.valueOf(1))
                .unitPrice(BigDecimal.valueOf(5000))
                .totalVAT(BigDecimal.valueOf(500))
                .totalCityTax(BigDecimal.valueOf(100))
                .totalAmount(BigDecimal.valueOf(5600));

// postRestReceiptRequestReceipt
        PostRestReceiptRequestReceipt postRestReceiptRequestReceipt = new PostRestReceiptRequestReceipt()
                .totalAmount(BigDecimal.valueOf(5600))
                .taxType("VAT_ABLE")
                .merchantTin("110718991986")
                .customerTin(null)
                .totalVAT(BigDecimal.valueOf(500))
                .totalCityTax(BigDecimal.valueOf(100))
                .invoiceId(null)
                .bankAccountNo("")
                .iBan("")
                .items(java.util.Arrays.asList(item));

// payments
        PostRestReceiptRequestPayment payment = new PostRestReceiptRequestPayment()
                .code("CASH")
                .status("PAID")
                .paidAmount(BigDecimal.valueOf(5600));

// attach lists
        post.receipts(java.util.Arrays.asList(postRestReceiptRequestReceipt));
        post.payments(java.util.Arrays.asList(payment));

// optional: print serialized JSON to console
//        System.out.println(JSON.serialize(post));

        PostRestReceiptResponse response = api.postRestReceipt(post);
        // TODO: test validations
    }

}
